#+TITLE: 各种不解笔记

** 基础
   使用C-h s命令可查看当前的语法表。

   不同字符类代表的不同含义：

   | 字符   | 含义            | 字符 | 含义                      |
   |--------+-----------------+------+---------------------------|
   | -      | 空白字符        | /    | character quote character |
   | w      | 单词组成        | $    | 成对边界符                |
   | 下划线 | symbol组成      | ’    | 表达式前缀                |
   | .      | 标点字符        | <    | 注释起始                  |
   | (      | 字符起始组成    | >    | 注释结束                  |
   | )      | 字符结尾组成    | !    | 通用注释组成              |
   | "      | 字符串quote字符 | 竖线 | 通用字符串组成            |
   | \      | 转义字符        | @    | 集成standard-syntax-table |

   比如w(单词组成)包含了无数字符，如a-z0-9，但不包含%$等字符，及中文字
   符等。

   可使用char-syntax函数返回字符所属类：

   #+BEGIN_SRC emacs-lisp :session
     (char-to-string (char-syntax ?+ ))
   #+END_SRC

   在正则中也可使用上表列出的的类，如"\sc"，其中c为上表列出的符号。如
   "\s("将匹配所有起始边界，而"\S("则是匹配所有非字符起始边界，相当于
   "\W"。

   #+BEGIN_SRC emacs-lisp :session
     (string-match-p "\\W" "hello world")
   #+END_SRC

   #+RESULTS:
   : 5

